Public Attributes | List of all members
API_StairRiserQuantity Struct Reference
Element Manager
Calculated values for the stair riser. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | volume
Volume of the riser.
 double  | slantAngle
Slant angle of the given riser.
 double  | width
The width of the given riser.
 double  | frontArea
Front surface area of the riser.
 Int32  | stepIndex
Step index of the given riser.
 Int32  | filler
Reserved for later use.
Detailed Description
Calculated values for the stair riser.